app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (name LIKE '%01761347519%' OR email LIKE '%01761347519%' OR phone LIKE '%01761347519%' OR cpf LIKE '%01761347519%')
---
  def index
    if params[:search]
      @users = User.search(params[:search])

INSERT INTO "users" ("name", "email", "phone", "cpf", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Maria"], ["email", "maria@email.com"], ["phone", "(28) 9 9274-6871"], ["cpf", "15580579780"], ["created_at", "2023-10-12 17:48:12.713958"], ["updated_at", "2023-10-12 17:48:12.713958"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save